{
  "keywords": "كودد، مدرس مختبر افتراضي، مختبرات علوم الحاسوب، مختبرات نظم المعلومات الحاسوبية، جامعة بيلكنت، روبوت محادثة ذكاء اصطناعي، فحص تشابه الأكواد، مقيم الكود النظيف، أتمتة حالات الاختبار، أدوات برمجة للطلاب، حلول برمجية ذكية، تكنولوجيا تعليمية، مساعدة في البرمجة، كفاءة البرمجة",
  "title": "كودد | سياسة ملفات تعريف الارتباط",
  "lastUpdated": "آخر تحديث: 4 سبتمبر 2024",
  "interpretationDefinitions": "التفسير والتعريفات",
  "interpretation": "التفسير",
  "interpretationText": "الكلمات التي تبدأ بحرف كبير لها معاني محددة وفقًا للشروط التالية. يكون للتعريفات التالية نفس المعنى بغض النظر عما إذا كانت تظهر بصيغة المفرد أو الجمع.",
  "definitions": "التعريفات",
  "definitionsText": "لأغراض سياسة ملفات تعريف الارتباط هذه:",
  "company": "الشركة",
  "companyText": "المشار إليها باسم \"الشركة\" أو \"نحن\" أو \"لنا\" أو \"خاصتنا\" في سياسة ملفات تعريف الارتباط هذه تشير إلى كودد.",
  "cookies": "ملفات تعريف الارتباط",
  "cookiesText": "تعني الملفات الصغيرة التي يتم وضعها على جهاز الكمبيوتر الخاص بك أو جهازك المحمول أو أي جهاز آخر بواسطة موقع ويب ، والتي تحتوي على تفاصيل محفوظات الاستعراض الخاصة بك على هذا الموقع من بين استخداماته العديدة.",
  "website": "الموقع الإلكتروني",
  "websiteText": "يشير إلى كودد ، يمكن الوصول إليه من https://coded-ai.github.io/coded.github.io/",
  "you": "أنت",
  "youText": "يعني الفرد الذي يصل إلى موقع الويب أو يستخدمه ، أو شركة ، أو أي كيان قانوني يقوم هذا الفرد بالوصول إلى موقع الويب أو استخدامه نيابة عنه ، حسب الاقتضاء.",
  "useOfCookies": "استخدام ملفات تعريف الارتباط",
  "typeOfCookies": "نوع ملفات تعريف الارتباط التي نستخدمها",
  "typeOfCookiesText": "يمكن أن تكون ملفات تعريف الارتباط \"دائمة\" أو \"مؤقتة\". تظل ملفات تعريف الارتباط الدائمة على جهاز الكمبيوتر الشخصي أو الجهاز المحمول الخاص بك عندما تكون غير متصل بالإنترنت ، بينما يتم حذف ملفات تعريف الارتباط المؤقتة بمجرد إغلاق متصفح الويب الخاص بك.",
  "cookiesPurposes": "نستخدم كلاً من ملفات تعريف الارتباط المؤقتة والدائمة للأغراض الموضحة أدناه:",
  "necessaryEssentialCookies": "ملفات تعريف الارتباط الضرورية / الأساسية",
  "necessaryEssentialType": "النوع: ملفات تعريف الارتباط المؤقتة",
  "necessaryEssentialAdministeredBy": "تُدار بواسطة: نحن",
  "necessaryEssentialPurpose": "الغرض: تعد ملفات تعريف الارتباط هذه ضرورية لتزويدك بالخدمات المتاحة عبر موقع الويب ولتمكينك من استخدام بعض ميزاته. فهي تساعد في مصادقة المستخدمين ومنع الاستخدام الاحتيالي لحسابات المستخدمين. بدون ملفات تعريف الارتباط هذه ، لا يمكن توفير الخدمات التي طلبتها ، ونحن نستخدم ملفات تعريف الارتباط هذه فقط لتزويدك بتلك الخدمات.",
  "functionalityCookies": "ملفات تعريف ارتباط الوظائف",
  "functionalityType": "النوع: ملفات تعريف الارتباط الدائمة",
  "functionalityAdministeredBy": "تُدار بواسطة: نحن",
  "functionalityPurpose": "الغرض: تتيح لنا ملفات تعريف الارتباط هذه تذكر الاختيارات التي تقوم بها عند استخدامك لموقع الويب ، مثل تذكر تفاصيل تسجيل الدخول الخاصة بك أو تفضيلات اللغة. الغرض من ملفات تعريف الارتباط هذه هو تزويدك بتجربة شخصية أكثر وتجنب الاضطرار إلى إعادة إدخال تفضيلاتك في كل مرة تستخدم فيها موقع الويب.",
  "yourChoices": "اختياراتك فيما يتعلق بملفات تعريف الارتباط",
  "yourChoicesText1": "إذا كنت تفضل تجنب استخدام ملفات تعريف الارتباط على موقع الويب ، فيجب عليك أولاً تعطيل استخدام ملفات تعريف الارتباط في متصفحك ثم حذف ملفات تعريف الارتباط المحفوظة في متصفحك المرتبطة بهذا الموقع. يمكنك استخدام هذا الخيار لمنع استخدام ملفات تعريف الارتباط في أي وقت.",
  "yourChoicesText2": "إذا لم تقبل ملفات تعريف الارتباط الخاصة بنا ، فقد تواجه بعض الإزعاج في استخدامك لموقع الويب وقد لا تعمل بعض الميزات بشكل صحيح.",
  "goBack": "عودة",
  "footerText": "© <span id=\"current-year\"></span> كودد | جميع الحقوق محفوظة",
  "descriptionText": "كودد هو مدرس المختبر الافتراضي الأمثل المصمم لطلاب علوم الحاسوب ونظم المعلومات الحاسوبية في جامعة بيلكنت. تقدم مجموعة من الأدوات الذكية بما في ذلك روبوت محادثة مدعوم بالذكاء الاصطناعي ، وفحص متقدم للتشابه ، ومقيم الكود النظيف ، ومشغل اختبار آلي ، تساعدك كودد على كتابة كود أنظف وأكثر كفاءة بسهولة.",
  "bannerText": "كودد قد فاز بجائزة الابتكار في معرض علوم الحاسوب في جامعة بيلكنت 2024!",
  "learnMore": "اعرف المزيد",
  "home": "الصفحة الرئيسية",
  "about": "حول",
  "academicReports": "التقارير الأكاديمية",
  "team": "الفريق",
  "contact": "اتصل بنا",
  "heroWelcomeText": "مرحبا بكم في <span>كودد.</span>",
  "heroWelcomeSubText": "تجديد التعلم بالذكاء الاصطناعي.",
  "introductionSectionHeading": "تمكين الطلاب من خلال <span class=\"highlight\">حلول برمجية ذكية</span>",
  "introductionSectionHighlightedText": "مرحبًا بكم في <strong>كودد</strong>، مدرس المختبر الافتراضي الأمثل المصمم خصيصًا لطلاب علوم الحاسوب ونظم المعلومات الحاسوبية في جامعة بيلكنت. نحن نسخر قوة الذكاء الاصطناعي لتحويل تجربة التعلم الخاصة بك، مما يجعل البرمجة أكثر بديهية وفعالية ومتعة.",
  "tryOnChatGPT": "جرب كودد على ChatGPT <i class=\"bx bx-chevron-left\"></i>",
  "followOnGithub": "تابعنا على GitHub <i class=\"bi bi-github\"></i>",
  "chatbotSectionTitle": "روبوت محادثة مدعوم بالذكاء الاصطناعي",
  "chatbotSectionDesc": "قم بحل استفساراتك المعملية على الفور باستخدام روبوت الدردشة الذكي الخاص بنا، والذي يوفر التوجيه دون تقديم إجابات مباشرة.",
  "similaritySectionTitle": "فحص متقدم للتشابه",
  "similaritySectionDesc": "تأكد من النزاهة الأكاديمية من خلال مقارنة الكود الخاص بك مع عمليات الإرسال والمستودعات السابقة.",
  "cleanCodeSectionTitle": "مقيم الكود النظيف",
  "cleanCodeSectionDesc": "احصل على تعليقات شاملة حول جودة الكود الخاص بك، بما في ذلك سهولة القراءة والكفاءة والأمان.",
  "testCaseRunnerSectionTitle": "مشغل حالات الاختبار الآلي",
  "testCaseRunnerSectionDesc": "قم بتشغيل الكود الخاص بك مقابل حالات اختبار متعددة دون عناء للتأكد من أنه يلبي جميع المتطلبات.",
  "academicReportsSectionTitle": "التقارير الأكاديمية <span class=\"highlight\">محمية بكلمة مرور</span>",
  "academicReportsSectionDesc": "جميع التقارير الأكاديمية محمية بكلمة مرور. لطلب الوصول، يرجى النقر على الزر أدناه وملء النموذج. ستتلقى بيانات الاعتماد اللازمة عبر البريد الإلكتروني.",
  "requestAccess": "طلب الوصول",
  "projectSpecificationReport": "تقرير مواصفات المشروع",
  "analysisAndRequirementsReport": "تقرير التحليل والمتطلبات",
  "fallSemesterPresentationDemo": "عرض وعرض تقديمي لفصل الخريف",
  "detailedDesignReport": "تقرير التصميم التفصيلي",
  "finalPresentationDemo": "عرض وعرض تقديمي نهائي",
  "finalReport": "التقرير النهائي",
  "view": "عرض",
  "new": "جديد",
  "teamStudentTitle": "طالب في السنة الأخيرة في جامعة بيلكنت",
  "teamSupervisorTitle": "المشرف",
  "teamInnovationExpertTitle": "خبير الابتكار",
  "quickLinks": "روابط سريعة",
  "documentation": "التوثيق",
  "location": "الموقع",
  "address": "جامعة بيلكنت<br>\n                        قسم علوم الحاسوب",
  "viewOnGoogleMaps": "عرض على خرائط جوجل",
  "termsOfService": "شروط الخدمة"
}