{
  "keywords": "CODED, virtuel laboratorievejleder, CS-laboratorier, CTIS-laboratorier, Bilkent Universitet, AI-chatbot, kodesammenligningskontrol, ren kode evaluator, testautomatisering, studerendes kodningsværktøjer, smarte kodningsløsninger, uddannelsesteknologi, programmeringshjælp, kodningseffektivitet",
  "title": "CODED | Cookiepolitik",
  "lastUpdated": "Sidst opdateret: 4. september 2024",
  "interpretationDefinitions": "Fortolkning og Definitioner",
  "interpretation": "Fortolkning",
  "interpretationText": "Ord, hvor det første bogstav er stort, har betydninger defineret under følgende betingelser. Disse definitioner har samme betydning, uanset om de forekommer i ental eller flertal.",
  "definitions": "Definitioner",
  "definitionsText": "Til formålet med denne Cookiepolitik:",
  "company": "Virksomhed",
  "companyText": "henviser i denne Cookiepolitik til CODED, som omtales som \"Virksomheden\", \"Vi\", \"Os\" eller \"Vores\".",
  "cookies": "Cookies",
  "cookiesText": "er små filer, der placeres på din computer, mobilenhed eller en anden enhed af et websted, som indeholder detaljer om din browserhistorik på det pågældende websted.",
  "website": "Hjemmeside",
  "websiteText": "henviser til CODED, tilgængelig fra https://coded-ai.github.io/coded.github.io/",
  "you": "Du",
  "youText": "henviser til den person, der tilgår eller bruger hjemmesiden, eller en virksomhed eller juridisk enhed på vegne af hvilken en sådan person tilgår eller bruger hjemmesiden.",
  "useOfCookies": "Brugen af Cookies",
  "typeOfCookies": "Typer af Cookies Vi Bruger",
  "typeOfCookiesText": "Cookies kan være \"Permanente\" eller \"Sessionsbaserede\". Permanente cookies forbliver på din computer eller mobilenhed, når du er offline, mens sessionsbaserede cookies slettes, så snart du lukker din browser.",
  "cookiesPurposes": "Vi bruger både sessions- og permanente cookies til de formål, der er beskrevet nedenfor:",
  "necessaryEssentialCookies": "Nødvendige / Essentielle Cookies",
  "necessaryEssentialType": "Type: Sessionscookies",
  "necessaryEssentialAdministeredBy": "Administreret af: Os",
  "necessaryEssentialPurpose": "Formål: Disse cookies er essentielle for at levere de tjenester, der er tilgængelige via hjemmesiden, og for at muliggøre brugen af nogle af dens funktioner. De hjælper med at autentificere brugere og forhindre svigagtig brug af brugerkonti. Uden disse cookies kan de tjenester, du har bedt om, ikke leveres.",
  "functionalityCookies": "Funktionalitets-Cookies",
  "functionalityType": "Type: Permanente Cookies",
  "functionalityAdministeredBy": "Administreret af: Os",
  "functionalityPurpose": "Formål: Disse cookies gør det muligt for os at huske de valg, du foretager, når du bruger hjemmesiden, såsom at huske dine loginoplysninger eller sprogpræferencer. Formålet med disse cookies er at give dig en mere personlig oplevelse og undgå, at du skal indtaste dine præferencer hver gang, du bruger hjemmesiden.",
  "yourChoices": "Dine Valg vedrørende Cookies",
  "yourChoicesText1": "Hvis du foretrækker at undgå brugen af cookies på hjemmesiden, skal du først deaktivere brugen af cookies i din browser og derefter slette de cookies, der er gemt i din browser, og som er tilknyttet denne hjemmeside. Du kan bruge denne mulighed for at forhindre brugen af cookies til enhver tid.",
  "yourChoicesText2": "Hvis du ikke accepterer vores cookies, kan du opleve nogle ulemper ved brugen af hjemmesiden, og nogle funktioner fungerer muligvis ikke korrekt.",
  "goBack": "Gå Tilbage",
  "footerText": "© <span id=\"current-year\"></span> CODED | Alle Rettigheder Forbeholdes",
  "descriptionText": "CODED er den ultimative virtuelle laboratorievejleder, designet til datalogistuderende og CTIS-studerende ved Bilkent Universitet. Med en række smarte værktøjer, herunder en AI-drevet chatbot, avanceret lignende kontrol, ren kode evaluator og automatiseret testkørsel, hjælper CODED dig med at skrive renere og mere effektiv kode med lethed.",
  "bannerText": "CODED har vundet Innovationsprisen på Bilkent Universitets CS Fair 2024!",
  "learnMore": "Læs Mere",
  "home": "Hjem",
  "about": "Om Os",
  "academicReports": "Akademiske Rapporteringer",
  "team": "Hold",
  "contact": "Kontakt",
  "heroWelcomeText": "Velkommen til <span>CODED.</span>",
  "heroWelcomeSubText": "Revolutionerer læring med AI.",
  "introductionSectionHeading": "Styrker Studerende med <span class=\"highlight\">Smarte Kodningsløsninger</span>",
  "introductionSectionHighlightedText": "Velkommen til <strong>CODED</strong>, din ultimative virtuelle laboratorievejleder, designet eksklusivt til datalogi- og CTIS-studerende ved Bilkent Universitet. Vi udnytter AI's kraft til at transformere din læringsoplevelse, hvilket gør kodning mere intuitiv, effektiv og fornøjelig.",
  "tryOnChatGPT": "Prøv CODED AI på ChatGPT <i class=\"bx bx-chevron-right\"></i>",
  "followOnGithub": "Følg os på GitHub <i class=\"bi bi-github\"></i>",
  "chatbotSectionTitle": "AI-drevet Chatbot",
  "chatbotSectionDesc": "Løs dine laboratorieproblemer øjeblikkeligt med vores smarte chatbot, der giver vejledning uden at afsløre direkte svar.",
  "similaritySectionTitle": "Avanceret Lignende Kontrol",
  "similaritySectionDesc": "Sikre akademisk integritet ved at sammenligne din kode med tidligere indsendelser og arkiver.",
  "cleanCodeSectionTitle": "Ren Kode Evaluator",
  "cleanCodeSectionDesc": "Få omfattende feedback på din kodes kvalitet, herunder læsbarhed, effektivitet og sikkerhed.",
  "testCaseRunnerSectionTitle": "Automatiseret Testkører",
  "testCaseRunnerSectionDesc": "Kør din kode mod flere testcases med lethed for at sikre, at den opfylder alle krav.",
  "academicReportsSectionTitle": "Akademiske rapporter er <span class=\"highlight\">adgangskodebeskyttet</span>",
  "academicReportsSectionDesc": "Alle akademiske rapporter er adgangskodebeskyttede. For at anmode om adgang skal du klikke på knappen nedenfor og udfylde formularen. Du vil modtage de nødvendige legitimationsoplysninger via e-mail.",
  "requestAccess": "Anmod om Adgang",
  "projectSpecificationReport": "Projektspecifikationsrapport",
  "analysisAndRequirementsReport": "Analyse- og Kravrapport",
  "fallSemesterPresentationDemo": "Præsentation og Demo i Efterårssemesteret",
  "detailedDesignReport": "Detaljeret Designrapport",
  "finalPresentationDemo": "Endelig Præsentation og Demo",
  "finalReport": "Endelig Rapport",
  "view": "Se",
  "new": "NY",
  "teamStudentTitle": "Seniorstuderende ved Bilkent Universitet",
  "teamSupervisorTitle": "Vejleder",
  "teamInnovationExpertTitle": "Innovationsspecialist",
  "quickLinks": "Hurtige Links",
  "documentation": "Dokumentation",
  "location": "Placering",
  "address": "Bilkent Universitet<br>\nInstituttet for Datalogi",
  "viewOnGoogleMaps": "Se på Google Maps",
  "termsOfService": "Servicevilkår"
}
