{
  "title": "CODED | Cookie-Richtlinie",
  "lastUpdated": "Zuletzt aktualisiert: 4. September 2024",
  "interpretationDefinitions": "Interpretation und Definitionen",
  "interpretation": "Interpretation",
  "interpretationText": "Die Wörter, deren Anfangsbuchstabe großgeschrieben ist, haben Bedeutungen, die unter den folgenden Bedingungen definiert sind. Die folgenden Definitionen haben dieselbe Bedeutung, unabhängig davon, ob sie im Singular oder im Plural erscheinen.",
  "definitions": "Definitionen",
  "definitionsText": "Für die Zwecke dieser Cookie-Richtlinie:",
  "company": "Unternehmen",
  "companyText": "in dieser Cookie-Richtlinie als \"das Unternehmen\", \"Wir\", \"Uns\" oder \"Unser\" bezeichnet, bezieht sich auf CODED.",
  "cookies": "Cookies",
  "cookiesText": "sind kleine Dateien, die von einer Website auf Ihrem Computer, Mobilgerät oder einem anderen Gerät platziert werden und Details zu Ihrem Surfverlauf auf dieser Website unter ihren vielen Verwendungen enthalten.",
  "website": "Website",
  "websiteText": "bezieht sich auf CODED, zugänglich unter <a href=\"https://coded-ai.github.io/coded.github.io/\" rel=\"external nofollow noopener\" target=\"_blank\">https://coded-ai.github.io/coded.github.io/</a>",
  "you": "Sie",
  "youText": "bezieht sich auf die Person, die auf die Website zugreift oder sie nutzt, oder auf ein Unternehmen oder eine juristische Person, in deren Namen diese Person auf die Website zugreift oder sie nutzt, soweit zutreffend.",
  "useOfCookies": "Die Verwendung von Cookies",
  "typeOfCookies": "Art der von uns verwendeten Cookies",
  "typeOfCookiesText": "Cookies können \"Persistente\" oder \"Sitzungs\"-Cookies sein. Persistente Cookies bleiben auf Ihrem persönlichen Computer oder Mobilgerät, wenn Sie offline sind, während Sitzungs-Cookies gelöscht werden, sobald Sie Ihren Webbrowser schließen.",
  "cookiesPurposes": "Wir verwenden sowohl Sitzungs- als auch persistente Cookies für die unten aufgeführten Zwecke:",
  "necessaryEssentialCookies": "Notwendige / Essentielle Cookies",
  "necessaryEssentialType": "Typ: Sitzungs-Cookies",
  "necessaryEssentialAdministeredBy": "Verwaltet von: Uns",
  "necessaryEssentialPurpose": "Zweck: Diese Cookies sind wesentlich, um Ihnen die über die Website verfügbaren Dienste bereitzustellen und Ihnen die Nutzung einiger ihrer Funktionen zu ermöglichen. Sie helfen bei der Authentifizierung von Benutzern und verhindern betrügerische Nutzung von Benutzerkonten. Ohne diese Cookies können die von Ihnen angeforderten Dienste nicht bereitgestellt werden, und wir verwenden diese Cookies ausschließlich, um Ihnen diese Dienste bereitzustellen.",
  "functionalityCookies": "Funktions-Cookies",
  "functionalityType": "Typ: Persistente Cookies",
  "functionalityAdministeredBy": "Verwaltet von: Uns",
  "functionalityPurpose": "Zweck: Diese Cookies ermöglichen es uns, uns an die von Ihnen getroffenen Entscheidungen zu erinnern, wenn Sie die Website nutzen, wie z.B. die Erinnerung an Ihre Anmeldedaten oder Spracheinstellung. Der Zweck dieser Cookies besteht darin, Ihnen ein persönlicheres Erlebnis zu bieten und zu vermeiden, dass Sie Ihre Einstellungen jedes Mal neu eingeben müssen, wenn Sie die Website nutzen.",
  "yourChoices": "Ihre Entscheidungen bezüglich Cookies",
  "yourChoicesText1": "Wenn Sie die Verwendung von Cookies auf der Website vermeiden möchten, müssen Sie zunächst die Verwendung von Cookies in Ihrem Browser deaktivieren und dann die in Ihrem Browser gespeicherten Cookies löschen, die mit dieser Website verbunden sind. Sie können diese Option jederzeit verwenden, um die Verwendung von Cookies zu verhindern.",
  "yourChoicesText2": "Wenn Sie unsere Cookies nicht akzeptieren, können Sie einige Unannehmlichkeiten bei der Nutzung der Website erfahren und einige Funktionen funktionieren möglicherweise nicht richtig.",
  "goBack": "Zurück",
  "footerText": "© <span id=\"current-year\"></span> CODED | Alle Rechte vorbehalten"
}
