{
  "keywords": "CODED, tutor virtual de laboratorio, laboratorios de CS, laboratorios de CTIS, Universidad de Bilkent, chatbot de IA, verificación de similitud de código, evaluador de código limpio, automatización de casos de prueba, herramientas de codificación para estudiantes, soluciones inteligentes de codificación, tecnología educativa, asistencia en programación, eficiencia de codificación",
  "title": "CODED | Política de Cookies",
  "lastUpdated": "Última actualización: 4 de Septiembre de 2024",
  "interpretationDefinitions": "Interpretación y Definiciones",
  "interpretation": "Interpretación",
  "interpretationText": "Las palabras cuya letra inicial está en mayúscula tienen significados definidos bajo las siguientes condiciones. Las siguientes definiciones tendrán el mismo significado independientemente de si aparecen en singular o en plural.",
  "definitions": "Definiciones",
  "definitionsText": "A los efectos de esta Política de Cookies:",
  "company": "Empresa",
  "companyText": "referida como \"la Empresa\", \"Nosotros\", \"Nos\" u \"Nuestro\" en esta Política de Cookies) se refiere a CODED.",
  "cookies": "Cookies",
  "cookiesText": "son pequeños archivos que se colocan en su computadora, dispositivo móvil u otro dispositivo por un sitio web, que contienen detalles de su historial de navegación en ese sitio web entre sus muchos usos.",
  "website": "Sitio Web",
  "websiteText": "se refiere a CODED, accesible desde <a href=\"https://coded-ai.github.io/coded.github.io/\" rel=\"external nofollow noopener\" target=\"_blank\">https://coded-ai.github.io/coded.github.io/</a>",
  "you": "Usted",
  "youText": "se refiere a la persona que accede o utiliza el Sitio Web, o una empresa, o cualquier entidad legal en nombre de la cual dicha persona está accediendo o utilizando el Sitio Web, según corresponda.",
  "useOfCookies": "El uso de las Cookies",
  "typeOfCookies": "Tipos de Cookies que Usamos",
  "typeOfCookiesText": "Las Cookies pueden ser \"Persistentes\" o \"de Sesión\". Las Cookies Persistentes permanecen en su computadora personal o dispositivo móvil cuando Usted se desconecta, mientras que las Cookies de Sesión se eliminan tan pronto como Usted cierra su navegador web.",
  "cookiesPurposes": "Usamos tanto Cookies de sesión como persistentes para los propósitos establecidos a continuación:",
  "necessaryEssentialCookies": "Cookies Necesarias / Esenciales",
  "necessaryEssentialType": "Tipo: Cookies de Sesión",
  "necessaryEssentialAdministeredBy": "Administradas por: Nosotros",
  "necessaryEssentialPurpose": "Propósito: Estas Cookies son esenciales para proporcionarle los servicios disponibles a través del Sitio Web y para permitirle utilizar algunas de sus funciones. Ayudan a autenticar a los usuarios y prevenir el uso fraudulento de cuentas de usuario. Sin estas Cookies, los servicios que usted ha solicitado no pueden ser proporcionados, y solo usamos estas Cookies para proporcionarle esos servicios.",
  "functionalityCookies": "Cookies de Funcionalidad",
  "functionalityType": "Tipo: Cookies Persistentes",
  "functionalityAdministeredBy": "Administradas por: Nosotros",
  "functionalityPurpose": "Propósito: Estas Cookies nos permiten recordar las elecciones que usted realiza cuando utiliza el Sitio Web, como recordar sus detalles de inicio de sesión o preferencia de idioma. El propósito de estas Cookies es proporcionarle una experiencia más personalizada y evitar que tenga que volver a ingresar sus preferencias cada vez que usa el Sitio Web.",
  "yourChoices": "Sus Opciones Respecto a las Cookies",
  "yourChoicesText1": "Si prefiere evitar el uso de Cookies en el Sitio Web, primero debe desactivar el uso de Cookies en su navegador y luego eliminar las Cookies guardadas en su navegador asociadas con este sitio web. Puede usar esta opción para prevenir el uso de Cookies en cualquier momento.",
  "yourChoicesText2": "Si no acepta nuestras Cookies, puede experimentar algunas molestias en su uso del Sitio Web y algunas funciones pueden no funcionar correctamente.",
  "goBack": "Volver",
  "footerText": "© <span id=\"current-year\"></span> CODED | Todos los Derechos Reservados",
  "descriptionText": "CODED es el tutor virtual definitivo diseñado para estudiantes de Ciencias de la Computación y CTIS de la Universidad de Bilkent. Con una suite de herramientas inteligentes, incluyendo un chatbot impulsado por IA, verificación avanzada de similitud, evaluador de código limpio y ejecutor automático de casos de prueba, CODED le ayuda a escribir código más limpio y eficiente con facilidad.",
  "bannerText": "¡CODED ha ganado el Premio a la Innovación en la Feria CS de la Universidad Bilkent 2024!",
  "learnMore": "Aprender Más",
  "home": "Inicio",
  "about": "Acerca de",
  "academicReports": "Informes Académicos",
  "team": "Equipo",
  "contact": "Contacto",
  "heroWelcomeText": "Bienvenido a <span>CODED.</span>",
  "heroWelcomeSubText": "Renovando el Aprendizaje con IA.",
  "introductionSectionHeading": "Empoderando a los Estudiantes con <span class=\"highlight\">Soluciones de Codificación Inteligente</span>",
  "introductionSectionHighlightedText": "Bienvenido a <strong>CODED</strong>, su tutor virtual de laboratorio definitivo diseñado exclusivamente para estudiantes de Ciencias de la Computación y CTIS en la Universidad Bilkent. Aprovechamos el poder de la IA para transformar su experiencia de aprendizaje, haciendo que la codificación sea más intuitiva, eficiente y placentera.",
  "tryOnChatGPT": "Prueba CODED AI en ChatGPT <i class=\"bx bx-chevron-right\"></i>",
  "followOnGithub": "Síguenos en GitHub <i class=\"bi bi-github\"></i>",
  "chatbotSectionTitle": "Chatbot Potenciado por IA",
  "chatbotSectionDesc": "Resuelva instantáneamente sus consultas de laboratorio con nuestro inteligente chatbot, proporcionando orientación sin ofrecer respuestas directas.",
  "similaritySectionTitle": "Verificación de Similaridad Avanzada",
  "similaritySectionDesc": "Asegure la integridad académica comparando su código con envíos y repositorios anteriores.",
  "cleanCodeSectionTitle": "Evaluador de Código Limpio",
  "cleanCodeSectionDesc": "Reciba comentarios completos sobre la calidad de su código, incluida la legibilidad, eficiencia y seguridad.",
  "testCaseRunnerSectionTitle": "Ejecutor de Casos de Prueba Automatizado",
  "testCaseRunnerSectionDesc": "Ejecute su código contra múltiples casos de prueba sin esfuerzo para asegurarse de que cumple con todos los requisitos.",
  "academicReportsSectionTitle": "Los informes académicos están <span class=\"highlight\">protegidos por contraseña</span>",
  "academicReportsSectionDesc": "Todos los informes académicos están protegidos por contraseña. Para solicitar acceso, haga clic en el botón a continuación y complete el formulario. Recibirá las credenciales necesarias por correo electrónico.",
  "requestAccess": "Solicitar Acceso",
  "projectSpecificationReport": "Informe de Especificación del Proyecto",
  "analysisAndRequirementsReport": "Informe de Análisis y Requisitos",
  "fallSemesterPresentationDemo": "Presentación y Demo del Semestre de Otoño",
  "detailedDesignReport": "Informe de Diseño Detallado",
  "finalPresentationDemo": "Presentación y Demo Final",
  "finalReport": "Informe Final",
  "view": "Ver",
  "new": "NUEVO",
  "teamStudentTitle": "Estudiante de Último Año en la Universidad Bilkent",
  "teamSupervisorTitle": "Supervisor",
  "teamInnovationExpertTitle": "Experto en Innovación",
  "quickLinks": "Enlaces Rápidos",
  "documentation": "Documentación",
  "location": "Ubicación",
  "address": "Universidad Bilkent<br>\nDepartamento de Ciencias de la Computación",
  "viewOnGoogleMaps": "Ver en Google Maps",
  "termsOfService": "Términos de Servicio"
}
