{
  "keywords": "CODED, tuteur virtuel de laboratoire, laboratoires CS, laboratoires CTIS, Université Bilkent, chatbot IA, vérification de similitude de code, évaluateur de code propre, automatisation des cas de test, outils de codage pour étudiants, solutions de codage intelligentes, technologie éducative, assistance à la programmation, efficacité du codage",
  "title": "CODED | Politique relative aux cookies",
  "lastUpdated": "Dernière mise à jour : 4 septembre 2024",
  "interpretationDefinitions": "Interprétation et Définitions",
  "interpretation": "Interprétation",
  "interpretationText": "Les mots dont la première lettre est en majuscule ont des significations définies dans les conditions suivantes. Les définitions suivantes auront la même signification, qu'elles apparaissent au singulier ou au pluriel.",
  "definitions": "Définitions",
  "definitionsText": "Aux fins de cette Politique relative aux cookies :",
  "company": "Entreprise",
  "companyText": "désigne soit \"l'Entreprise\", \"Nous\", \"Notre\" ou \"Nos\" dans cette Politique relative aux cookies et fait référence à CODED.",
  "cookies": "Cookies",
  "cookiesText": "désigne les petits fichiers qui sont placés sur votre ordinateur, appareil mobile ou tout autre appareil par un site web, contenant des détails sur votre historique de navigation sur ce site parmi ses nombreuses utilisations.",
  "website": "Site Web",
  "websiteText": "désigne CODED, accessible depuis https://coded-ai.github.io/coded.github.io/",
  "you": "Vous",
  "youText": "désigne l'individu accédant ou utilisant le site Web, ou une entreprise ou une entité légale au nom de laquelle un tel individu accède ou utilise le site Web, selon le cas.",
  "useOfCookies": "Utilisation des Cookies",
  "typeOfCookies": "Types de Cookies que Nous Utilisons",
  "typeOfCookiesText": "Les cookies peuvent être \"Persistants\" ou \"Session\". Les cookies persistants restent sur votre ordinateur personnel ou appareil mobile lorsque vous êtes hors ligne, tandis que les cookies de session sont supprimés dès que vous fermez votre navigateur Web.",
  "cookiesPurposes": "Nous utilisons à la fois des cookies de session et des cookies persistants pour les objectifs décrits ci-dessous :",
  "necessaryEssentialCookies": "Cookies nécessaires / essentiels",
  "necessaryEssentialType": "Type : Cookies de session",
  "necessaryEssentialAdministeredBy": "Administré par : Nous",
  "necessaryEssentialPurpose": "Objectif : Ces cookies sont essentiels pour vous fournir les services disponibles via le site Web et vous permettre d'utiliser certaines de ses fonctionnalités. Ils aident à authentifier les utilisateurs et à prévenir l'utilisation frauduleuse des comptes utilisateur. Sans ces cookies, les services que vous avez demandés ne peuvent pas être fournis, et Nous utilisons uniquement ces cookies pour vous fournir ces services.",
  "functionalityCookies": "Cookies fonctionnels",
  "functionalityType": "Type : Cookies persistants",
  "functionalityAdministeredBy": "Administré par : Nous",
  "functionalityPurpose": "Objectif : Ces cookies nous permettent de mémoriser les choix que vous faites lorsque vous utilisez le site Web, comme mémoriser vos informations de connexion ou vos préférences linguistiques. Le but de ces cookies est de vous offrir une expérience plus personnalisée et d'éviter que vous ayez à saisir à nouveau vos préférences chaque fois que vous utilisez le site Web.",
  "yourChoices": "Vos Choix Concernant les Cookies",
  "yourChoicesText1": "Si vous préférez éviter l'utilisation de cookies sur le site Web, vous devez d'abord désactiver l'utilisation des cookies dans votre navigateur, puis supprimer les cookies enregistrés dans votre navigateur associés à ce site Web. Vous pouvez utiliser cette option pour empêcher l'utilisation de cookies à tout moment.",
  "yourChoicesText2": "Si vous n'acceptez pas Nos cookies, vous pourriez rencontrer des inconvénients dans l'utilisation du site Web et certaines fonctionnalités pourraient ne pas fonctionner correctement.",
  "goBack": "Retour",
  "footerText": "© <span id=\"current-year\"></span> CODED | Tous droits réservés",
  "descriptionText": "CODED est le tuteur virtuel ultime conçu pour les étudiants en informatique et CTIS de l'Université Bilkent. Offrant une suite d'outils intelligents, y compris un chatbot alimenté par l'IA, une vérification avancée de similitude, un évaluateur de code propre et un exécuteur de cas de test automatisé, CODED vous aide à écrire un code plus propre et plus efficace en toute simplicité.",
  "bannerText": "CODED a remporté le Prix de l'Innovation à la Foire CS de l'Université Bilkent 2024 !",
  "learnMore": "En savoir plus",
  "home": "Accueil",
  "about": "À propos",
  "academicReports": "Rapports académiques",
  "team": "Équipe",
  "contact": "Contact",
  "heroWelcomeText": "Bienvenue chez <span>CODED.</span>",
  "heroWelcomeSubText": "Rénover l'apprentissage avec l'IA.",
  "introductionSectionHeading": "Donner du pouvoir aux étudiants avec <span class=\"highlight\">des solutions de codage intelligentes</span>",
  "introductionSectionHighlightedText": "Bienvenue chez <strong>CODED</strong>, votre tuteur virtuel ultime conçu exclusivement pour les étudiants en informatique et CTIS de l'Université Bilkent. Nous exploitons la puissance de l'IA pour transformer votre expérience d'apprentissage, rendant le codage plus intuitif, efficace et agréable.",
  "tryOnChatGPT": "Essayez CODED AI sur ChatGPT <i class=\"bx bx-chevron-right\"></i>",
  "followOnGithub": "Suivez-nous sur GitHub <i class=\"bi bi-github\"></i>",
  "chatbotSectionTitle": "Chatbot alimenté par l'IA",
  "chatbotSectionDesc": "Résolvez instantanément vos questions de laboratoire avec notre chatbot intelligent, fournissant des conseils sans donner de réponses directes.",
  "similaritySectionTitle": "Vérification avancée de similitude",
  "similaritySectionDesc": "Assurez l'intégrité académique en comparant votre code avec des soumissions et des référentiels précédents.",
  "cleanCodeSectionTitle": "Évaluateur de code propre",
  "cleanCodeSectionDesc": "Recevez des retours complets sur la qualité de votre code, y compris la lisibilité, l'efficacité et la sécurité.",
  "testCaseRunnerSectionTitle": "Exécuteur de cas de test automatisé",
  "testCaseRunnerSectionDesc": "Exécutez votre code sur plusieurs cas de test sans effort pour vous assurer qu'il répond à toutes les exigences.",
  "academicReportsSectionTitle": "Les rapports académiques sont <span class=\"highlight\">protégés par mot de passe</span>",
  "academicReportsSectionDesc": "Tous les rapports académiques sont protégés par mot de passe. Pour demander l'accès, veuillez cliquer sur le bouton ci-dessous et remplir le formulaire. Vous recevrez les informations d'identification nécessaires par e-mail.",
  "requestAccess": "Demander un accès",
  "projectSpecificationReport": "Rapport de spécifications du projet",
  "analysisAndRequirementsReport": "Analyse et exigences",
  "fallSemesterPresentationDemo": "Présentation et démonstration du semestre d'automne",
  "detailedDesignReport": "Rapport de conception détaillée",
  "finalPresentationDemo": "Présentation finale et démonstration",
  "finalReport": "Rapport final",
  "view": "Voir",
  "new": "NOUVEAU",
  "teamStudentTitle": "Étudiant de dernière année à l'Université Bilkent",
  "teamSupervisorTitle": "Superviseur",
  "teamInnovationExpertTitle": "Expert en innovation",
  "quickLinks": "Liens rapides",
  "documentation": "Documentation",
  "location": "Emplacement",
  "address": "Université Bilkent<br>\n                        Département d'informatique",
  "viewOnGoogleMaps": "Voir sur Google Maps",
  "termsOfService": "Conditions d'utilisation"
}
