{
  "keywords": "CODED, tutor virtuale per laboratori, laboratori CS, laboratori CTIS, Università Bilkent, chatbot AI, controllo somiglianza codice, valutatore codice pulito, automazione casi di test, strumenti per studenti di programmazione, soluzioni intelligenti per il coding, tecnologia educativa, assistenza alla programmazione, efficienza nel coding",
  "title": "CODED | Politica sui Cookie",
  "lastUpdated": "Ultimo aggiornamento: 4 settembre 2024",
  "interpretationDefinitions": "Interpretazione e Definizioni",
  "interpretation": "Interpretazione",
  "interpretationText": "Le parole di cui la lettera iniziale è maiuscola hanno significati definiti nelle seguenti condizioni. Le seguenti definizioni avranno lo stesso significato indipendentemente dal fatto che appaiano al singolare o al plurale.",
  "definitions": "Definizioni",
  "definitionsText": "Ai fini di questa Politica sui Cookie:",
  "company": "Azienda",
  "companyText": "denominata \"l'Azienda\", \"Noi\", \"Ci\" o \"Nostro\" in questa Politica sui Cookie, si riferisce a CODED.",
  "cookies": "Cookie",
  "cookiesText": "indica piccoli file che vengono posizionati sul tuo computer, dispositivo mobile o qualsiasi altro dispositivo da un sito web, contenenti dettagli sulla tua cronologia di navigazione su quel sito tra i suoi vari utilizzi.",
  "website": "Sito Web",
  "websiteText": "si riferisce a CODED, accessibile da https://coded-ai.github.io/coded.github.io/",
  "you": "Tu",
  "youText": "indica l'individuo che accede o utilizza il Sito Web, o un'azienda, o qualsiasi entità legale per conto della quale tale individuo accede o utilizza il Sito Web, come applicabile.",
  "useOfCookies": "Uso dei Cookie",
  "typeOfCookies": "Tipi di Cookie che Utilizziamo",
  "typeOfCookiesText": "I cookie possono essere \"Persistenti\" o \"Di Sessione\". I Cookie Persistenti rimangono sul tuo computer personale o dispositivo mobile quando vai offline, mentre i Cookie di Sessione vengono eliminati non appena chiudi il tuo browser web.",
  "cookiesPurposes": "Utilizziamo sia Cookie di sessione che persistenti per i seguenti scopi:",
  "necessaryEssentialCookies": "Cookie Necessari / Essenziali",
  "necessaryEssentialType": "Tipo: Cookie di Sessione",
  "necessaryEssentialAdministeredBy": "Gestito da: Noi",
  "necessaryEssentialPurpose": "Scopo: Questi Cookie sono essenziali per fornirti servizi disponibili tramite il Sito Web e consentirti di utilizzare alcune delle sue funzionalità. Aiutano ad autenticare gli utenti e prevenire l'uso fraudolento degli account utente. Senza questi Cookie, i servizi che hai richiesto non possono essere forniti, e Noi utilizziamo questi Cookie solo per fornirti tali servizi.",
  "functionalityCookies": "Cookie di Funzionalità",
  "functionalityType": "Tipo: Cookie Persistenti",
  "functionalityAdministeredBy": "Gestito da: Noi",
  "functionalityPurpose": "Scopo: Questi Cookie ci consentono di ricordare le scelte che fai quando utilizzi il Sito Web, come i tuoi dati di accesso o la preferenza della lingua. Lo scopo di questi Cookie è fornirti un'esperienza più personalizzata e evitare che tu debba reinserire le tue preferenze ogni volta che utilizzi il Sito Web.",
  "yourChoices": "Le tue Scelte sui Cookie",
  "yourChoicesText1": "Se preferisci evitare l'uso dei Cookie sul Sito Web, devi prima disabilitare l'uso dei Cookie nel tuo browser e poi eliminare i Cookie salvati nel tuo browser associati a questo sito web. Puoi utilizzare questa opzione per evitare l'uso dei Cookie in qualsiasi momento.",
  "yourChoicesText2": "Se non accetti i Nostri Cookie, potresti riscontrare alcuni inconvenienti nell'uso del Sito Web e alcune funzionalità potrebbero non funzionare correttamente.",
  "goBack": "Torna Indietro",
  "footerText": "© <span id=\"current-year\"></span> CODED | Tutti i diritti riservati",
  "descriptionText": "CODED è il tutor virtuale per laboratori definitivo progettato per studenti di Informatica e CTIS dell'Università Bilkent. Con una suite di strumenti intelligenti tra cui un chatbot basato su AI, controllo avanzato di somiglianza, valutatore di codice pulito e runner di casi di test automatizzati, CODED ti aiuta a scrivere codice più pulito ed efficiente con facilità.",
  "bannerText": "CODED ha vinto il Premio Innovazione alla Fiera CS 2024 dell'Università Bilkent!",
  "learnMore": "Scopri di più",
  "home": "Home",
  "about": "Chi Siamo",
  "academicReports": "Report Accademici",
  "team": "Team",
  "contact": "Contatti",
  "heroWelcomeText": "Benvenuto in <span>CODED.</span>",
  "heroWelcomeSubText": "Rinnoviamo l'Apprendimento con l'AI.",
  "introductionSectionHeading": "Potenziare gli Studenti con <span class=\"highlight\">Soluzioni Intelligenti per il Coding</span>",
  "introductionSectionHighlightedText": "Benvenuto in <strong>CODED</strong>, il tuo tutor virtuale per laboratori progettato esclusivamente per studenti di Informatica e CTIS all'Università Bilkent. Sfruttiamo il potere dell'AI per trasformare la tua esperienza di apprendimento, rendendo il coding più intuitivo, efficiente e divertente.",
  "tryOnChatGPT": "Prova CODED AI su ChatGPT <i class=\"bx bx-chevron-right\"></i>",
  "followOnGithub": "Seguici su GitHub <i class=\"bi bi-github\"></i>",
  "chatbotSectionTitle": "Chatbot Basato su AI",
  "chatbotSectionDesc": "Risolvete istantaneamente i vostri dubbi di laboratorio con il nostro chatbot intelligente, che fornisce guida senza offrire risposte dirette.",
  "similaritySectionTitle": "Controllo Avanzato di Somiglianza",
  "similaritySectionDesc": "Garantisci l'integrità accademica confrontando il tuo codice con sottomissioni precedenti e repository.",
  "cleanCodeSectionTitle": "Valutatore di Codice Pulito",
  "cleanCodeSectionDesc": "Ricevi feedback completi sulla qualità del tuo codice, inclusi leggibilità, efficienza e sicurezza.",
  "testCaseRunnerSectionTitle": "Runner di Casi di Test Automatizzati",
  "testCaseRunnerSectionDesc": "Esegui il tuo codice su più casi di test senza sforzo per assicurarti che soddisfi tutti i requisiti.",
  "academicReportsSectionTitle": "I report accademici sono <span class=\"highlight\">protetti da password</span>",
  "academicReportsSectionDesc": "Tutti i report accademici sono protetti da password. Per richiedere l'accesso, clicca sul pulsante sottostante e compila il modulo. Riceverai le credenziali necessarie via email.",
  "requestAccess": "Richiedi Accesso",
  "projectSpecificationReport": "Report di Specifica del Progetto",
  "analysisAndRequirementsReport": "Analisi e Requisiti",
  "fallSemesterPresentationDemo": "Presentazione e Demo del Semestre Autunnale",
  "detailedDesignReport": "Report di Progettazione Dettagliata",
  "finalPresentationDemo": "Presentazione e Demo Finale",
  "finalReport": "Report Finale",
  "view": "Visualizza",
  "new": "NUOVO",
  "teamStudentTitle": "Studente Senior presso l'Università Bilkent",
  "teamSupervisorTitle": "Supervisore",
  "teamInnovationExpertTitle": "Esperto di Innovazione",
  "quickLinks": "Link Utili",
  "documentation": "Documentazione",
  "location": "Posizione",
  "address": "Università Bilkent<br>\n                        Dipartimento di Informatica",
  "viewOnGoogleMaps": "Visualizza su Google Maps",
  "termsOfService": "Termini di Servizio"
}
