{
  "keywords": "CODED, virtuele labtutor, CS-labs, CTIS-labs, Bilkent Universiteit, AI-chatbot, codesimilariteitscontrole, schone code-evaluator, testautomatisering, programmeerhulpmiddelen voor studenten, slimme programmeeroplossingen, educatieve technologie, programmeerassistentie, programmeerefficiëntie",
  "title": "CODED | Cookiebeleid",
  "lastUpdated": "Laatst bijgewerkt: 4 september 2024",
  "interpretationDefinitions": "Interpretatie en Definities",
  "interpretation": "Interpretatie",
  "interpretationText": "De woorden waarvan de beginletter een hoofdletter is, hebben betekenissen die zijn gedefinieerd onder de volgende voorwaarden. De volgende definities hebben dezelfde betekenis, ongeacht of ze in enkelvoud of meervoud voorkomen.",
  "definitions": "Definities",
  "definitionsText": "Voor de doeleinden van dit Cookiebeleid:",
  "company": "Bedrijf",
  "companyText": "verwezen naar als \"het Bedrijf\", \"Wij\", \"Ons\" of \"Onze\" in dit Cookiebeleid verwijst naar CODED.",
  "cookies": "Cookies",
  "cookiesText": "betekent kleine bestanden die op uw computer, mobiele apparaat of een ander apparaat door een website worden geplaatst, met details van uw browsegeschiedenis op die website, naast andere doeleinden.",
  "website": "Website",
  "websiteText": "verwijst naar CODED, toegankelijk via https://coded-ai.github.io/coded.github.io/",
  "you": "U",
  "youText": "betekent de persoon die toegang heeft tot of gebruik maakt van de Website, of een bedrijf, of een rechtspersoon namens wie een dergelijke persoon toegang heeft tot of gebruik maakt van de Website, indien van toepassing.",
  "useOfCookies": "Gebruik van Cookies",
  "typeOfCookies": "Soorten Cookies die We Gebruiken",
  "typeOfCookiesText": "Cookies kunnen 'Persistente' of 'Sessie'-Cookies zijn. Persistente Cookies blijven op uw computer of mobiele apparaat wanneer U offline bent, terwijl Sessie-Cookies worden verwijderd zodra U uw webbrowser sluit.",
  "cookiesPurposes": "We gebruiken zowel sessie- als persistente cookies voor de hieronder beschreven doeleinden:",
  "necessaryEssentialCookies": "Noodzakelijke / Essentiële Cookies",
  "necessaryEssentialType": "Type: Sessie-Cookies",
  "necessaryEssentialAdministeredBy": "Beheerd door: Ons",
  "necessaryEssentialPurpose": "Doel: Deze cookies zijn essentieel om U diensten aan te bieden die beschikbaar zijn via de Website en om U in staat te stellen sommige van zijn functies te gebruiken. Ze helpen gebruikers te authenticeren en frauduleus gebruik van gebruikersaccounts te voorkomen. Zonder deze cookies kunnen de door U gevraagde diensten niet worden geleverd, en we gebruiken deze cookies alleen om U die diensten te leveren.",
  "functionalityCookies": "Functionele Cookies",
  "functionalityType": "Type: Persistente Cookies",
  "functionalityAdministeredBy": "Beheerd door: Ons",
  "functionalityPurpose": "Doel: Deze cookies stellen ons in staat om keuzes te onthouden die U maakt bij het gebruik van de Website, zoals het onthouden van uw inloggegevens of taalvoorkeur. Het doel van deze cookies is om U een meer persoonlijke ervaring te bieden en te voorkomen dat U telkens uw voorkeuren opnieuw moet invoeren.",
  "yourChoices": "Uw Keuzes Betreffende Cookies",
  "yourChoicesText1": "Als U het gebruik van cookies op de Website wilt vermijden, moet U eerst het gebruik van cookies in uw browser uitschakelen en vervolgens de in uw browser opgeslagen cookies verwijderen die zijn gekoppeld aan deze website. U kunt deze optie op elk moment gebruiken om het gebruik van cookies te voorkomen.",
  "yourChoicesText2": "Als U onze cookies niet accepteert, kunt U enig ongemak ondervinden bij het gebruik van de Website en sommige functies werken mogelijk niet correct.",
  "goBack": "Ga Terug",
  "footerText": "© <span id=\"current-year\"></span> CODED | Alle rechten voorbehouden",
  "descriptionText": "CODED is de ultieme virtuele labtutor, ontworpen voor studenten Computerwetenschappen en CTIS aan de Bilkent Universiteit. Met een reeks slimme tools, waaronder een AI-chatbot, geavanceerde similariteitscontrole, schone code-evaluator en geautomatiseerde testuitvoering, helpt CODED u om eenvoudiger, efficiënter en schoner te programmeren.",
  "bannerText": "CODED heeft de Innovatieprijs gewonnen op de CS Fair 2024 van de Bilkent Universiteit!",
  "learnMore": "Meer informatie",
  "home": "Startpagina",
  "about": "Over Ons",
  "academicReports": "Academische Rapporten",
  "team": "Team",
  "contact": "Contact",
  "heroWelcomeText": "Welkom bij <span>CODED.</span>",
  "heroWelcomeSubText": "Leren opnieuw uitvinden met AI.",
  "introductionSectionHeading": "Studenten Empoweren met <span class=\"highlight\">Slimme Programmeeroplossingen</span>",
  "introductionSectionHighlightedText": "Welkom bij <strong>CODED</strong>, uw ultieme virtuele labtutor die exclusief is ontworpen voor studenten Computerwetenschappen en CTIS aan de Bilkent Universiteit. We benutten de kracht van AI om uw leerervaring te transformeren en programmeren intuïtiever, efficiënter en plezieriger te maken.",
  "tryOnChatGPT": "Probeer CODED AI op ChatGPT <i class=\"bx bx-chevron-right\"></i>",
  "followOnGithub": "Volg ons op GitHub <i class=\"bi bi-github\"></i>",
  "chatbotSectionTitle": "AI-gestuurde Chatbot",
  "chatbotSectionDesc": "Los uw labvragen direct op met onze slimme chatbot, die begeleiding biedt zonder directe antwoorden te geven.",
  "similaritySectionTitle": "Geavanceerde Similariteitscontrole",
  "similaritySectionDesc": "Zorg voor academische integriteit door uw code te vergelijken met eerdere inzendingen en repositories.",
  "cleanCodeSectionTitle": "Schone Code Evaluator",
  "cleanCodeSectionDesc": "Ontvang uitgebreide feedback over de kwaliteit van uw code, inclusief leesbaarheid, efficiëntie en beveiliging.",
  "testCaseRunnerSectionTitle": "Geautomatiseerde Testuitvoering",
  "testCaseRunnerSectionDesc": "Voer uw code probleemloos uit tegen meerdere testcases om ervoor te zorgen dat deze aan alle eisen voldoet.",
  "academicReportsSectionTitle": "Academische rapporten zijn <span class=\"highlight\">wachtwoord beschermd</span>",
  "academicReportsSectionDesc": "Alle academische rapporten zijn wachtwoord beschermd. Om toegang aan te vragen, klik op de onderstaande knop en vul het formulier in. U ontvangt de benodigde inloggegevens via e-mail.",
  "requestAccess": "Toegang Aanvragen",
  "projectSpecificationReport": "Project Specificatierapport",
  "analysisAndRequirementsReport": "Analyse en Vereistenrapport",
  "fallSemesterPresentationDemo": "Presentatie en Demo Herfstsemester",
  "detailedDesignReport": "Gedetailleerd Ontwerp Rapport",
  "finalPresentationDemo": "Eindpresentatie en Demo",
  "finalReport": "Eindrapport",
  "view": "Bekijk",
  "new": "NIEUW",
  "teamStudentTitle": "Seniorstudent aan Bilkent Universiteit",
  "teamSupervisorTitle": "Begeleider",
  "teamInnovationExpertTitle": "Innovatiedeskundige",
  "quickLinks": "Snelle Links",
  "documentation": "Documentatie",
  "location": "Locatie",
  "address": "Bilkent Universiteit<br>\n                        Afdeling Computerwetenschappen",
  "viewOnGoogleMaps": "Bekijk op Google Maps",
  "termsOfService": "Gebruiksvoorwaarden"
}
