{
  "keywords": "CODED, virtuell labveileder, CS-laboratorier, CTIS-laboratorier, Bilkent Universitet, AI-chatbot, kodesammenligning, ren kode vurdering, testautomatisering, studentverktøy for koding, smarte kodingsløsninger, utdanningsteknologi, programmeringsstøtte, kodeeffektivitet",
  "title": "CODED | Retningslinjer for informasjonskapsler",
  "lastUpdated": "Sist oppdatert: 4. september 2024",
  "interpretationDefinitions": "Fortolkning og Definisjoner",
  "interpretation": "Fortolkning",
  "interpretationText": "Ordene som har stor forbokstav har betydning som definert under følgende betingelser. Disse definisjonene har samme betydning uavhengig av om de vises i entall eller flertall.",
  "definitions": "Definisjoner",
  "definitionsText": "For formålet med disse retningslinjene for informasjonskapsler:",
  "company": "Selskap",
  "companyText": "refereres til som enten \"Selskapet\", \"Vi\", \"Oss\" eller \"Vår\" i disse retningslinjene og refererer til CODED.",
  "cookies": "Informasjonskapsler",
  "cookiesText": "er små filer som plasseres på datamaskinen, mobilenheten eller andre enheter av en nettside, og inneholder detaljer om nettleserhistorikken din på den nettsiden.",
  "website": "Nettside",
  "websiteText": "refererer til CODED, tilgjengelig på https://coded-ai.github.io/coded.github.io/",
  "you": "Du",
  "youText": "betyr den personen som får tilgang til eller bruker nettsiden, eller en bedrift eller juridisk enhet på vegne av hvem en slik person får tilgang til eller bruker nettsiden.",
  "useOfCookies": "Bruk av informasjonskapsler",
  "typeOfCookies": "Typer informasjonskapsler vi bruker",
  "typeOfCookiesText": "Informasjonskapsler kan være \"Vedvarende\" eller \"Øktbaserte\". Vedvarende informasjonskapsler forblir på datamaskinen eller mobilenheten din når du er offline, mens øktbaserte informasjonskapsler slettes så snart du lukker nettleseren.",
  "cookiesPurposes": "Vi bruker både øktbaserte og vedvarende informasjonskapsler til følgende formål:",
  "necessaryEssentialCookies": "Nødvendige / Essensielle informasjonskapsler",
  "necessaryEssentialType": "Type: Øktbaserte informasjonskapsler",
  "necessaryEssentialAdministeredBy": "Administrert av: Oss",
  "necessaryEssentialPurpose": "Formål: Disse informasjonskapslene er nødvendige for å gi deg tjenester tilgjengelig gjennom nettsiden og for å muliggjøre bruk av noen av funksjonene. De hjelper med autentisering av brukere og forhindrer svindel med brukerkontoer. Uten disse informasjonskapslene kan ikke de forespurte tjenestene leveres.",
  "functionalityCookies": "Funksjonelle informasjonskapsler",
  "functionalityType": "Type: Vedvarende informasjonskapsler",
  "functionalityAdministeredBy": "Administrert av: Oss",
  "functionalityPurpose": "Formål: Disse informasjonskapslene lar oss huske valgene du gjør når du bruker nettsiden, som å huske innloggingsdetaljer eller språkpreferanse. Målet med disse informasjonskapslene er å gi deg en mer personlig opplevelse og forhindre at du må angi preferansene dine på nytt hver gang du bruker nettsiden.",
  "yourChoices": "Dine valg angående informasjonskapsler",
  "yourChoicesText1": "Hvis du foretrekker å unngå bruken av informasjonskapsler på nettsiden, må du først deaktivere bruken av informasjonskapsler i nettleseren din og deretter slette informasjonskapslene som er lagret i nettleseren din knyttet til denne nettsiden. Du kan bruke dette alternativet for å forhindre bruken av informasjonskapsler når som helst.",
  "yourChoicesText2": "Hvis du ikke aksepterer våre informasjonskapsler, kan du oppleve noen ulemper ved bruken av nettsiden, og noen funksjoner kan ikke fungere som de skal.",
  "goBack": "Gå tilbake",
  "footerText": "© <span id=\"current-year\"></span> CODED | Alle rettigheter forbeholdt",
  "descriptionText": "CODED er den ultimate virtuelle labveilederen designet for studenter i informatikk og CTIS ved Bilkent Universitet. Med et utvalg av smarte verktøy, inkludert en AI-drevet chatbot, avansert sammenligningskontroll, ren kode vurdering og automatisert testkjøring, hjelper CODED deg med å skrive renere og mer effektiv kode med letthet.",
  "bannerText": "CODED vant Innovasjonsprisen på Bilkent Universitetets CS-messe 2024!",
  "learnMore": "Lær mer",
  "home": "Hjem",
  "about": "Om oss",
  "academicReports": "Akademiske rapporter",
  "team": "Team",
  "contact": "Kontakt oss",
  "heroWelcomeText": "Velkommen til <span>CODED.</span>",
  "heroWelcomeSubText": "Revolusjonerer læring med AI.",
  "introductionSectionHeading": "Gir studenter <span class=\"highlight\">smarte kodingsløsninger</span>",
  "introductionSectionHighlightedText": "Velkommen til <strong>CODED</strong>, din ultimate virtuelle labveileder, designet eksklusivt for informatikk- og CTIS-studenter ved Bilkent Universitet. Vi bruker kraften i AI til å transformere læringserfaringen din, noe som gjør koding mer intuitiv, effektiv og morsom.",
  "tryOnChatGPT": "Prøv CODED AI på ChatGPT <i class=\"bx bx-chevron-right\"></i>",
  "followOnGithub": "Følg oss på GitHub <i class=\"bi bi-github\"></i>",
  "chatbotSectionTitle": "AI-drevet Chatbot",
  "chatbotSectionDesc": "Løs laboratorieproblemer umiddelbart med vår smarte chatbot, som gir veiledning uten å avsløre direkte svar.",
  "similaritySectionTitle": "Avansert sammenligningskontroll",
  "similaritySectionDesc": "Sikre akademisk integritet ved å sammenligne koden din med tidligere innleveringer og arkiver.",
  "cleanCodeSectionTitle": "Ren kode vurdering",
  "cleanCodeSectionDesc": "Få omfattende tilbakemeldinger om kvaliteten på koden din, inkludert lesbarhet, effektivitet og sikkerhet.",
  "testCaseRunnerSectionTitle": "Automatisert testkjører",
  "testCaseRunnerSectionDesc": "Kjør koden din mot flere testtilfeller enkelt for å sikre at den oppfyller alle krav.",
  "academicReportsSectionTitle": "Akademiske rapporter er <span class=\"highlight\">passordbeskyttet</span>",
  "academicReportsSectionDesc": "Alle akademiske rapporter er passordbeskyttet. For å be om tilgang, klikk på knappen nedenfor og fyll ut skjemaet. Du vil motta de nødvendige legitimasjonene via e-post.",
  "requestAccess": "Be om tilgang",
  "projectSpecificationReport": "Prosjektspesifikasjonsrapport",
  "analysisAndRequirementsReport": "Analyse- og kravrapport",
  "fallSemesterPresentationDemo": "Høstsemester presentasjon og demo",
  "detailedDesignReport": "Detaljert designrapport",
  "finalPresentationDemo": "Sluttpresentasjon og demo",
  "finalReport": "Sluttrapport",
  "view": "Se",
  "new": "NY",
  "teamStudentTitle": "Seniorstudent ved Bilkent Universitet",
  "teamSupervisorTitle": "Veileder",
  "teamInnovationExpertTitle": "Innovasjonsekspert",
  "quickLinks": "Hurtiglenker",
  "documentation": "Dokumentasjon",
  "location": "Plassering",
  "address": "Bilkent Universitet<br>\nInstitutt for informatikk",
  "viewOnGoogleMaps": "Se på Google Maps",
  "termsOfService": "Bruksvilkår"
}
