{
  "keywords": "CODED, wirtualny asystent laboratoryjny, laboratoria CS, laboratoria CTIS, Uniwersytet Bilkent, chatbot AI, sprawdzanie podobieństwa kodu, ocena czystego kodu, automatyzacja testów, narzędzia do programowania dla studentów, inteligentne rozwiązania programistyczne, technologia edukacyjna, pomoc w programowaniu, efektywność kodowania",
  "title": "CODED | Polityka plików cookie",
  "lastUpdated": "Ostatnia aktualizacja: 4 września 2024",
  "interpretationDefinitions": "Interpretacja i Definicje",
  "interpretation": "Interpretacja",
  "interpretationText": "Słowa, których pierwsza litera jest napisana wielką literą, mają znaczenia określone w poniższych warunkach. Następujące definicje mają to samo znaczenie niezależnie od tego, czy występują w liczbie pojedynczej, czy mnogiej.",
  "definitions": "Definicje",
  "definitionsText": "Na potrzeby niniejszej Polityki plików cookie:",
  "company": "Firma",
  "companyText": "określana jako \"Firma\", \"My\", \"Nas\" lub \"Nasza\" w niniejszej Polityce plików cookie odnosi się do CODED.",
  "cookies": "Pliki cookie",
  "cookiesText": "oznaczają małe pliki umieszczane na Twoim komputerze, urządzeniu mobilnym lub innym urządzeniu przez stronę internetową, zawierające szczegóły Twojej historii przeglądania na tej stronie w różnych celach.",
  "website": "Strona internetowa",
  "websiteText": "odnosi się do CODED, dostępnej pod adresem https://coded-ai.github.io/coded.github.io/",
  "you": "Ty",
  "youText": "oznacza osobę uzyskującą dostęp do Strony internetowej lub korzystającą z niej, albo firmę lub inną osobę prawną, w imieniu której taka osoba uzyskuje dostęp do Strony internetowej lub z niej korzysta, jeśli ma to zastosowanie.",
  "useOfCookies": "Wykorzystanie Plików Cookie",
  "typeOfCookies": "Rodzaje Plików Cookie, których Używamy",
  "typeOfCookiesText": "Pliki cookie mogą być \"Trwałe\" lub \"Sesyjne\". Trwałe Pliki Cookie pozostają na Twoim komputerze lub urządzeniu mobilnym, gdy jesteś offline, podczas gdy Sesyjne Pliki Cookie są usuwane natychmiast po zamknięciu przeglądarki internetowej.",
  "cookiesPurposes": "Używamy zarówno sesyjnych, jak i trwałych plików cookie do celów określonych poniżej:",
  "necessaryEssentialCookies": "Niezbędne / Podstawowe Pliki Cookie",
  "necessaryEssentialType": "Typ: Sesyjne Pliki Cookie",
  "necessaryEssentialAdministeredBy": "Zarządzane przez: Nas",
  "necessaryEssentialPurpose": "Cel: Te pliki cookie są niezbędne, aby zapewnić Ci usługi dostępne za pośrednictwem Strony internetowej i umożliwić korzystanie z niektórych jej funkcji. Pomagają uwierzytelnić użytkowników i zapobiegają oszukańczemu użyciu kont użytkowników. Bez tych plików cookie usługi, o które prosisz, nie mogą zostać dostarczone, a My używamy tych plików cookie wyłącznie w celu dostarczenia Ci tych usług.",
  "functionalityCookies": "Funkcjonalne Pliki Cookie",
  "functionalityType": "Typ: Trwałe Pliki Cookie",
  "functionalityAdministeredBy": "Zarządzane przez: Nas",
  "functionalityPurpose": "Cel: Te pliki cookie pozwalają nam zapamiętać wybory, których dokonujesz podczas korzystania ze Strony internetowej, takie jak zapamiętanie Twoich danych logowania lub preferencji językowych. Celem tych plików cookie jest zapewnienie Ci bardziej spersonalizowanego doświadczenia i unikanie konieczności ponownego wprowadzania Twoich preferencji za każdym razem, gdy korzystasz ze Strony internetowej.",
  "yourChoices": "Twoje Wybory Dotyczące Plików Cookie",
  "yourChoicesText1": "Jeśli wolisz unikać korzystania z plików cookie na Stronie internetowej, najpierw musisz wyłączyć korzystanie z plików cookie w swojej przeglądarce, a następnie usunąć pliki cookie zapisane w przeglądarce związane z tą stroną. Możesz skorzystać z tej opcji, aby w dowolnym momencie zapobiec używaniu plików cookie.",
  "yourChoicesText2": "Jeśli nie zaakceptujesz Naszych plików cookie, możesz doświadczyć pewnych niedogodności podczas korzystania ze Strony internetowej, a niektóre funkcje mogą nie działać prawidłowo.",
  "goBack": "Wróć",
  "footerText": "© <span id=\"current-year\"></span> CODED | Wszelkie prawa zastrzeżone",
  "descriptionText": "CODED to ostateczny wirtualny asystent laboratoryjny zaprojektowany dla studentów Informatyki i CTIS na Uniwersytecie Bilkent. Oferując zestaw inteligentnych narzędzi, w tym chatbot oparty na sztucznej inteligencji, zaawansowaną kontrolę podobieństwa, ocenę czystego kodu i zautomatyzowanego wykonawcę testów, CODED pomaga pisać czystszy i bardziej efektywny kod z łatwością.",
  "bannerText": "CODED zdobył nagrodę za innowację na targach CS Fair 2024 Uniwersytetu Bilkent!",
  "learnMore": "Dowiedz się więcej",
  "home": "Strona główna",
  "about": "O nas",
  "academicReports": "Raporty Akademickie",
  "team": "Zespół",
  "contact": "Kontakt",
  "heroWelcomeText": "Witamy w <span>CODED.</span>",
  "heroWelcomeSubText": "Odnawiamy naukę dzięki AI.",
  "introductionSectionHeading": "Wzmacnianie studentów dzięki <span class=\"highlight\">inteligentnym rozwiązaniom programistycznym</span>",
  "introductionSectionHighlightedText": "Witamy w <strong>CODED</strong>, Twoim ostatecznym wirtualnym asystencie laboratoryjnym, zaprojektowanym wyłącznie dla studentów Informatyki i CTIS na Uniwersytecie Bilkent. Wykorzystujemy moc AI, aby przekształcić Twoje doświadczenia edukacyjne, czyniąc programowanie bardziej intuicyjnym, efektywnym i przyjemnym.",
  "tryOnChatGPT": "Wypróbuj CODED AI na ChatGPT <i class=\"bx bx-chevron-right\"></i>",
  "followOnGithub": "Śledź nas na GitHub <i class=\"bi bi-github\"></i>",
  "chatbotSectionTitle": "Chatbot Wspierany przez AI",
  "chatbotSectionDesc": "Natychmiast rozwiązuj pytania laboratoryjne dzięki naszemu inteligentnemu chatbotowi, który udziela wskazówek bez podawania bezpośrednich odpowiedzi.",
  "similaritySectionTitle": "Zaawansowana Kontrola Podobieństwa",
  "similaritySectionDesc": "Zapewnij integralność akademicką, porównując swój kod z wcześniejszymi zgłoszeniami i repozytoriami.",
  "cleanCodeSectionTitle": "Ocena Czystego Kodu",
  "cleanCodeSectionDesc": "Otrzymuj kompleksowe informacje zwrotne na temat jakości swojego kodu, w tym czytelności, efektywności i bezpieczeństwa.",
  "testCaseRunnerSectionTitle": "Zautomatyzowany Wykonawca Testów",
  "testCaseRunnerSectionDesc": "Bezproblemowo uruchamiaj swój kod na wielu przypadkach testowych, aby upewnić się, że spełnia wszystkie wymagania.",
  "academicReportsSectionTitle": "Raporty akademickie są <span class=\"highlight\">chronione hasłem</span>",
  "academicReportsSectionDesc": "Wszystkie raporty akademickie są chronione hasłem. Aby poprosić o dostęp, kliknij poniższy przycisk i wypełnij formularz. Otrzymasz niezbędne dane logowania e-mailem.",
  "requestAccess": "Poproś o dostęp",
  "projectSpecificationReport": "Raport Specyfikacji Projektu",
  "analysisAndRequirementsReport": "Analiza i Wymagania",
  "fallSemesterPresentationDemo": "Prezentacja i Demo Semestru Jesiennego",
  "detailedDesignReport": "Szczegółowy Raport Projektowy",
  "finalPresentationDemo": "Finalna Prezentacja i Demo",
  "finalReport": "Raport Końcowy",
  "view": "Zobacz",
  "new": "NOWY",
  "teamStudentTitle": "Student senior Uniwersytetu Bilkent",
  "teamSupervisorTitle": "Opiekun",
  "teamInnovationExpertTitle": "Ekspert ds. innowacji",
  "quickLinks": "Szybkie linki",
  "documentation": "Dokumentacja",
  "location": "Lokalizacja",
  "address": "Uniwersytet Bilkent<br>\n                        Wydział Informatyki",
  "viewOnGoogleMaps": "Zobacz na Mapach Google",
  "termsOfService": "Warunki korzystania"
}
