{
  "keywords": "CODED, tutor de laboratório virtual, laboratórios de CS, laboratórios de CTIS, Universidade Bilkent, chatbot de IA, verificação de similaridade de código, avaliador de código limpo, automação de casos de teste, ferramentas de codificação para estudantes, soluções de codificação inteligentes, tecnologia educacional, assistência de programação, eficiência de codificação",
  "title": "CODED | Política de Cookies",
  "lastUpdated": "Última atualização: 4 de setembro de 2024",
  "interpretationDefinitions": "Interpretação e Definições",
  "interpretation": "Interpretação",
  "interpretationText": "As palavras cuja letra inicial está em maiúscula têm os significados definidos nas seguintes condições. Estas definições terão o mesmo significado, seja no singular ou no plural.",
  "definitions": "Definições",
  "definitionsText": "Para os fins desta Política de Cookies:",
  "company": "Empresa",
  "companyText": "referida como \"a Empresa\", \"Nós\", \"Nosso\" ou \"Nosso\" nesta Política de Cookies refere-se à CODED.",
  "cookies": "Cookies",
  "cookiesText": "são pequenos arquivos armazenados no seu computador, dispositivo móvel ou qualquer outro dispositivo por um site, contendo detalhes do seu histórico de navegação nesse site para vários fins.",
  "website": "Website",
  "websiteText": "refere-se ao CODED, acessível a partir de https://coded-ai.github.io/coded.github.io/",
  "you": "Você",
  "youText": "significa o indivíduo que acessa ou usa o Website, ou uma empresa ou entidade legal em nome da qual tal indivíduo acessa ou usa o Website, conforme aplicável.",
  "useOfCookies": "O uso de Cookies",
  "typeOfCookies": "Tipos de Cookies que Usamos",
  "typeOfCookiesText": "Os cookies podem ser \"Persistentes\" ou \"De Sessão\". Os Cookies Persistentes permanecem no seu computador ou dispositivo móvel quando você está offline, enquanto os Cookies de Sessão são apagados assim que você fecha o navegador.",
  "cookiesPurposes": "Utilizamos ambos os cookies de sessão e persistentes para os fins descritos abaixo:",
  "necessaryEssentialCookies": "Cookies Necessários/Essenciais",
  "necessaryEssentialType": "Tipo: Cookies de Sessão",
  "necessaryEssentialAdministeredBy": "Administrado por: Nós",
  "necessaryEssentialPurpose": "Propósito: Esses cookies são essenciais para fornecer os serviços disponíveis no Website e permitir que você use algumas de suas funcionalidades. Eles ajudam a autenticar os usuários e prevenir o uso fraudulento de contas de usuário. Sem esses cookies, os serviços solicitados por você não podem ser fornecidos.",
  "functionalityCookies": "Cookies Funcionais",
  "functionalityType": "Tipo: Cookies Persistentes",
  "functionalityAdministeredBy": "Administrado por: Nós",
  "functionalityPurpose": "Propósito: Esses cookies permitem que lembremos as escolhas que você faz ao usar o Website, como lembrar seus detalhes de login ou preferência de idioma. O objetivo desses cookies é oferecer uma experiência mais personalizada e evitar que você tenha que reintroduzir suas preferências a cada vez que usar o Website.",
  "yourChoices": "Suas Escolhas em Relação aos Cookies",
  "yourChoicesText1": "Se preferir evitar o uso de cookies no Website, primeiro você deve desativar o uso de cookies no seu navegador e depois excluir os cookies salvos no navegador associados a este site.",
  "yourChoicesText2": "Se você não aceitar nossos cookies, poderá enfrentar alguns inconvenientes no uso do Website e algumas funcionalidades podem não funcionar corretamente.",
  "goBack": "Voltar",
  "footerText": "© <span id=\"current-year\"></span> CODED | Todos os Direitos Reservados",
  "descriptionText": "CODED é o tutor de laboratório virtual definitivo, projetado para estudantes de Ciência da Computação e CTIS na Universidade Bilkent. Oferecendo uma gama de ferramentas inteligentes, incluindo um chatbot com inteligência artificial, verificação avançada de similaridade, avaliador de código limpo e execução automática de casos de teste, CODED ajuda você a escrever códigos mais limpos e eficientes com facilidade.",
  "bannerText": "CODED ganhou o Prêmio de Inovação na Feira de Ciências da Computação da Universidade Bilkent em 2024!",
  "learnMore": "Saiba Mais",
  "home": "Início",
  "about": "Sobre",
  "academicReports": "Relatórios Acadêmicos",
  "team": "Equipe",
  "contact": "Contato",
  "heroWelcomeText": "Bem-vindo ao <span>CODED.</span>",
  "heroWelcomeSubText": "Renovando o Aprendizado com IA.",
  "introductionSectionHeading": "Empoderando Estudantes com <span class=\"highlight\">Soluções Inteligentes de Codificação</span>",
  "introductionSectionHighlightedText": "Bem-vindo ao <strong>CODED</strong>, seu tutor virtual definitivo de laboratório, projetado exclusivamente para estudantes de Ciência da Computação e CTIS da Universidade Bilkent. Utilizamos o poder da IA para transformar sua experiência de aprendizado, tornando a programação mais intuitiva, eficiente e agradável.",
  "tryOnChatGPT": "Experimente o CODED AI no ChatGPT <i class=\"bx bx-chevron-right\"></i>",
  "followOnGithub": "Siga-nos no GitHub <i class=\"bi bi-github\"></i>",
  "chatbotSectionTitle": "Chatbot com IA",
  "chatbotSectionDesc": "Resolva instantaneamente suas dúvidas de laboratório com nosso chatbot inteligente, que fornece orientação sem entregar respostas diretas.",
  "similaritySectionTitle": "Verificação Avançada de Similaridade",
  "similaritySectionDesc": "Garanta integridade acadêmica comparando seu código com submissões anteriores e repositórios.",
  "cleanCodeSectionTitle": "Avaliador de Código Limpo",
  "cleanCodeSectionDesc": "Receba feedback abrangente sobre a qualidade do seu código, incluindo legibilidade, eficiência e segurança.",
  "testCaseRunnerSectionTitle": "Executador Automático de Casos de Teste",
  "testCaseRunnerSectionDesc": "Execute seu código contra múltiplos casos de teste com facilidade, garantindo que atenda a todos os requisitos.",
  "academicReportsSectionTitle": "Relatórios acadêmicos estão <span class=\"highlight\">protegidos por senha</span>",
  "academicReportsSectionDesc": "Todos os relatórios acadêmicos estão protegidos por senha. Para solicitar acesso, clique no botão abaixo e preencha o formulário. Você receberá as credenciais necessárias por e-mail.",
  "requestAccess": "Solicitar Acesso",
  "projectSpecificationReport": "Relatório de Especificação do Projeto",
  "analysisAndRequirementsReport": "Relatório de Análise e Requisitos",
  "fallSemesterPresentationDemo": "Apresentação e Demonstração do Semestre de Outono",
  "detailedDesignReport": "Relatório de Design Detalhado",
  "finalPresentationDemo": "Apresentação e Demonstração Final",
  "finalReport": "Relatório Final",
  "view": "Ver",
  "new": "NOVO",
  "teamStudentTitle": "Estudante Sênior na Universidade Bilkent",
  "teamSupervisorTitle": "Supervisor",
  "teamInnovationExpertTitle": "Especialista em Inovação",
  "quickLinks": "Links Rápidos",
  "documentation": "Documentação",
  "location": "Localização",
  "address": "Universidade Bilkent<br>\n                        Departamento de Ciência da Computação",
  "viewOnGoogleMaps": "Ver no Google Maps",
  "termsOfService": "Termos de Serviço"
}
