{
  "keywords": "CODED, virtuell labhandledare, CS-labb, CTIS-labb, Bilkent Universitet, AI-chattbot, kodlikhetskontroll, ren kod utvärderare, testautomatisering, studentverktyg för programmering, smarta kodlösningar, utbildningsteknologi, programmeringshjälp, kodningseffektivitet",
  "title": "CODED | Cookiepolicy",
  "lastUpdated": "Senast uppdaterad: 4 september 2024",
  "interpretationDefinitions": "Tolkning och Definitioner",
  "interpretation": "Tolkning",
  "interpretationText": "Orden vars begynnelsebokstav är versaler har betydelser som definieras enligt följande villkor. Följande definitioner ska ha samma betydelse, oavsett om de förekommer i singular eller plural.",
  "definitions": "Definitioner",
  "definitionsText": "I denna Cookiepolicy:",
  "company": "Företag",
  "companyText": "kallas \"Företaget\", \"Vi\", \"Oss\" eller \"Vår\" i denna Cookiepolicy och syftar på CODED.",
  "cookies": "Cookies",
  "cookiesText": "är små filer som placeras på din dator, mobiltelefon eller annan enhet av en webbplats, innehållande detaljer om din webbläsarhistorik på den webbplatsen bland dess många användningsområden.",
  "website": "Webbplats",
  "websiteText": "syftar på CODED, som är tillgängligt via https://coded-ai.github.io/coded.github.io/",
  "you": "Du",
  "youText": "syftar på den person som besöker eller använder Webbplatsen, eller ett företag, eller en juridisk enhet för vars räkning en sådan person besöker eller använder Webbplatsen, där så är tillämpligt.",
  "useOfCookies": "Användning av Cookies",
  "typeOfCookies": "Typer av Cookies vi Använder",
  "typeOfCookiesText": "Cookies kan vara \"Permanenta\" eller \"Session\" Cookies. Permanenta Cookies finns kvar på din dator eller mobila enhet när du går offline, medan Sessionscookies raderas så snart du stänger din webbläsare.",
  "cookiesPurposes": "Vi använder både sessionscookies och permanenta cookies för de ändamål som anges nedan:",
  "necessaryEssentialCookies": "Nödvändiga / Väsentliga Cookies",
  "necessaryEssentialType": "Typ: Sessionscookies",
  "necessaryEssentialAdministeredBy": "Administreras av: Oss",
  "necessaryEssentialPurpose": "Syfte: Dessa cookies är nödvändiga för att ge dig tjänster som är tillgängliga via Webbplatsen och för att möjliggöra vissa av dess funktioner. De hjälper till att autentisera användare och förhindra bedrägligt användande av användarkonton. Utan dessa cookies kan de tjänster du har begärt inte tillhandahållas, och vi använder endast dessa cookies för att ge dig dessa tjänster.",
  "functionalityCookies": "Funktionscookies",
  "functionalityType": "Typ: Permanenta cookies",
  "functionalityAdministeredBy": "Administreras av: Oss",
  "functionalityPurpose": "Syfte: Dessa cookies gör det möjligt för oss att komma ihåg de val du gör när du använder Webbplatsen, till exempel att komma ihåg dina inloggningsuppgifter eller språkpreferenser. Syftet med dessa cookies är att ge dig en mer personlig upplevelse och förhindra att du behöver ange dina preferenser igen varje gång du använder Webbplatsen.",
  "yourChoices": "Dina Val angående Cookies",
  "yourChoicesText1": "Om du föredrar att undvika användningen av cookies på Webbplatsen måste du först inaktivera användningen av cookies i din webbläsare och sedan radera de cookies som sparats i din webbläsare som är associerade med denna webbplats. Du kan använda detta alternativ för att förhindra användningen av cookies när som helst.",
  "yourChoicesText2": "Om du inte accepterar våra cookies kan du uppleva vissa olägenheter när du använder Webbplatsen, och vissa funktioner kanske inte fungerar korrekt.",
  "goBack": "Tillbaka",
  "footerText": "© <span id=\"current-year\"></span> CODED | Alla Rättigheter Förbehållna",
  "descriptionText": "CODED är den ultimata virtuella labhandledaren som är designad för studenter i datavetenskap och CTIS vid Bilkent Universitet. Med en uppsättning smarta verktyg, inklusive en AI-driven chattbot, avancerad likhetskontroll, ren kodutvärderare och automatiserad testkörning, hjälper CODED dig att skriva renare och mer effektiv kod enkelt.",
  "bannerText": "CODED vann innovationspriset vid Bilkent Universitet CS-mässa 2024!",
  "learnMore": "Läs mer",
  "home": "Hem",
  "about": "Om oss",
  "academicReports": "Akademiska Rapporter",
  "team": "Team",
  "contact": "Kontakt",
  "heroWelcomeText": "Välkommen till <span>CODED.</span>",
  "heroWelcomeSubText": "Förnya lärandet med AI.",
  "introductionSectionHeading": "Stärka studenter med <span class=\"highlight\">smarta kodlösningar</span>",
  "introductionSectionHighlightedText": "Välkommen till <strong>CODED</strong>, din ultimata virtuella labhandledare som är exklusivt designad för studenter i datavetenskap och CTIS vid Bilkent Universitet. Vi använder kraften i AI för att förändra din inlärningsupplevelse och göra programmering mer intuitiv, effektiv och rolig.",
  "tryOnChatGPT": "Prova CODED AI på ChatGPT <i class=\"bx bx-chevron-right\"></i>",
  "followOnGithub": "Följ oss på GitHub <i class=\"bi bi-github\"></i>",
  "chatbotSectionTitle": "AI-Driven Chattbot",
  "chatbotSectionDesc": "Få omedelbara svar på dina labbfrågor med vår smarta chattbot, som ger vägledning utan att avslöja direkta svar.",
  "similaritySectionTitle": "Avancerad Likhetskontroll",
  "similaritySectionDesc": "Säkerställ akademisk integritet genom att jämföra din kod med tidigare inlämningar och repositories.",
  "cleanCodeSectionTitle": "Ren Kodutvärderare",
  "cleanCodeSectionDesc": "Få omfattande feedback på din kodkvalitet, inklusive läsbarhet, effektivitet och säkerhet.",
  "testCaseRunnerSectionTitle": "Automatiserad Testkörning",
  "testCaseRunnerSectionDesc": "Kör din kod mot flera testfall utan ansträngning för att säkerställa att den uppfyller alla krav.",
  "academicReportsSectionTitle": "Akademiska rapporter är <span class=\"highlight\">lösenordsskyddade</span>",
  "academicReportsSectionDesc": "Alla akademiska rapporter är lösenordsskyddade. För att begära åtkomst, vänligen klicka på knappen nedan och fyll i formuläret. Du kommer att få nödvändiga inloggningsuppgifter via e-post.",
  "requestAccess": "Begär åtkomst",
  "projectSpecificationReport": "Projektspecifikationsrapport",
  "analysisAndRequirementsReport": "Analys och kravrapport",
  "fallSemesterPresentationDemo": "Höstterminens presentation och demo",
  "detailedDesignReport": "Detaljerad designrapport",
  "finalPresentationDemo": "Slutpresentation och demo",
  "finalReport": "Slutrapport",
  "view": "Visa",
  "new": "NY",
  "teamStudentTitle": "Seniorstudent vid Bilkent Universitet",
  "teamSupervisorTitle": "Handledare",
  "teamInnovationExpertTitle": "Innovationsspecialist",
  "quickLinks": "Snabblänkar",
  "documentation": "Dokumentation",
  "location": "Plats",
  "address": "Bilkent Universitet<br>\n                        Institutionen för Datavetenskap",
  "viewOnGoogleMaps": "Visa på Google Maps",
  "termsOfService": "Användarvillkor"
}
