{
  "title": "CODED | Çerez Politikası",
  "lastUpdated": "Son güncelleme: 4 Eylül 2024",
  "interpretationDefinitions": "Yorumlama ve Tanımlar",
  "interpretation": "Yorumlama",
  "interpretationText": "Başlangıç harfi büyük olan kelimelerin aşağıdaki koşullar altında tanımlanan anlamları vardır. Aşağıdaki tanımlar, tekil veya çoğul olarak görünseler de aynı anlama sahip olacaktır.",
  "definitions": "Tanımlar",
  "definitionsText": "Bu Çerez Politikası kapsamında:",
  "company": "Şirket",
  "companyText": "Bu Çerez Politikası'nda \"Şirket\", \"Biz\", \"Bizler\" veya \"Bizim\" olarak anılan CODED'yi ifade eder.",
  "cookies": "Çerezler",
  "cookiesText": "bir web sitesi tarafından bilgisayarınıza, mobil cihazınıza veya herhangi başka bir cihaza yerleştirilen küçük dosyalar olup, bu web sitesindeki gezinme geçmişinizin ayrıntılarını içeren ve birçok kullanım alanı olan çerezlerdir.",
  "website": "Web Sitesi",
  "websiteText": "https://coded-ai.github.io/coded.github.io/ adresinden erişilebilen CODED'yi ifade eder.",
  "you": "Siz",
  "youText": "Web Sitesine erişen veya Web Sitesini kullanan bireyi veya böyle bir bireyin adına Web Sitesine erişen veya kullanan bir şirketi ya da herhangi bir tüzel kişiliği ifade eder.",
  "useOfCookies": "Çerezlerin Kullanımı",
  "typeOfCookies": "Kullandığımız Çerez Türleri",
  "typeOfCookiesText": "Çerezler \"Kalıcı\" veya \"Oturum\" Çerezleri olabilir. Kalıcı Çerezler, Çevrimdışıyken bile kişisel bilgisayarınızda veya mobil cihazınızda kalırken, Oturum Çerezleri web tarayıcınızı kapattığınızda silinir.",
  "cookiesPurposes": "Aşağıda belirtilen amaçlar için hem oturum hem de kalıcı çerezler kullanıyoruz:",
  "necessaryEssentialCookies": "Gerekli / Esas Çerezler",
  "necessaryEssentialType": "Tür: Oturum Çerezleri",
  "necessaryEssentialAdministeredBy": "Yönetilen: Biz",
  "necessaryEssentialPurpose": "Amaç: Bu Çerezler, Web Sitesi aracılığıyla size sunulan hizmetleri sağlamamız ve Web Sitesinin bazı özelliklerini kullanabilmenizi sağlamamız için esastır. Kullanıcıları doğrulamaya ve kullanıcı hesaplarının sahte kullanımını önlemeye yardımcı olurlar. Bu Çerezler olmadan, sizden talep ettiğiniz hizmetler sağlanamaz ve bu Çerezleri sadece size bu hizmetleri sunmak için kullanırız.",
  "functionalityCookies": "Fonksiyonellik Çerezleri",
  "functionalityType": "Tür: Kalıcı Çerezler",
  "functionalityAdministeredBy": "Yönetilen: Biz",
  "functionalityPurpose": "Amaç: Bu Çerezler, Web Sitesini kullanırken yaptığınız seçimleri hatırlamamıza olanak tanır, örneğin giriş bilgilerinizi veya dil tercihinizi hatırlamak gibi. Bu Çerezlerin amacı, size daha kişisel bir deneyim sunmak ve Web Sitesini her kullandığınızda tercihlerinizin yeniden girilmesini önlemektir.",
  "yourChoices": "Çerezler Hakkında Seçimleriniz",
  "yourChoicesText1": "Web Sitesinde Çerezlerin kullanımından kaçınmayı tercih ediyorsanız, önce tarayıcınızda Çerezlerin kullanımını devre dışı bırakmalı ve ardından bu web sitesi ile ilişkili olarak tarayıcınızda kaydedilen Çerezleri silmelisiniz. Çerez kullanımını herhangi bir zamanda engellemek için bu seçeneği kullanabilirsiniz.",
  "yourChoicesText2": "Çerezlerimizi kabul etmezseniz, Web Sitesini kullanırken bazı rahatsızlıklar yaşayabilir ve bazı özellikler düzgün çalışmayabilir.",
  "goBack": "Geri Dön",
  "footerText": "© <span id=\"current-year\"></span> CODED | Tüm Hakları Saklıdır"
}
